#+TITLE: AWS Solutions Architect Associate Study Notes
#+STARTUP: logdone
#+TODO: TODO IN-PROGRESS | DONE(!)

https://aws.amazon.com/certification/

* TODO Review Official Exam Guide
https://d1.awsstatic.com/training-and-certification/docs-sa-assoc/AWS_Certified_Solutions_Architect_Associate_Feb_2018_%20Exam_Guide_v1.5.2.pdf

* TODO Review AWS Well-Architected Framework
https://aws.amazon.com/architecture/well-architected/

* TODO Retake Udemy Course

** DONE Section 1: Introduction 2019
   CLOSED: [2019-05-31 Fri 17:58]
     
   - 130 Minutes in Length
   - 60 Questions
   - Multiple Choice
   - Results are between 100-1000 with a passing score of 720
   - Aim for 70%
   - Qualification is valid for 2 years
   - Scenario based questions
   - Practice Exam is $20
   - Registration is $150
 
** DONE Section 2: AWS - 10,000 Foot Overview (2019 course)
   CLOSED: [2019-05-31 Fri 18:15]
 
*** Definitions
    
    - A *Region* is a geographical area. Each *Region* consists of 2 (or more) *Availability Zones*.
    - An *Availibility Zone* is one or more data centers in a given area, depending on proximity.
    - An *Edge Location* is an endpoint for AWS which are used for caching content. Think *CloudFront CDN*
      - _150_ *Edge Locations* around the world.
      
*** What do you need to know to pass?
    
    - Security, Identity & Compliance (IAM inside out)
    - Network & Content Delivery (Route53, VPCs) # Very Important
    - Compute (EC2, Lambda)
    - Storage (S3)
    - Databases (RDS, DynamoDB, Redshift)
    - AWS Global Infrastructure
   
** IN-PROGRESS Section 3: Identity Access Management & S3 (2019 course)
   :LOGBOOK:
   CLOCK: [2019-06-24 Mon 16:44]--[2019-06-24 Mon 17:04] =>  0:20
   :END:
  
*** IAM 101
    
    *Features*
    
    - Centralised control of your AWS account
    - Shared Access to your AWS account
    - Granular Permissions
    - Identity Federation (AD, Facebook, LinkedIn, etc)
    - Multifacture Auth
    - Temp Access
    - Password Policy
    - Integrates with MANY AWS services
    - PCI DSS

**** Users
     End users such as people, employees of an organization.
 
**** Groups
     A collection of users. Each user in a group will inherit the permissions of the group.

**** Policies
     Policies are made up of documents, called Policy documents. These are JSON and they give permissions as to what a User/Group/Role is able to do.

**** Roles
     Create roles and assign them to AWS resources.
     
*** IAM Lab
    
    - Create MFA for Root Account
    - All is done on the Global Region
    - Create a user (programatic access - access key ID and secret access key)
    - Create a group for the user (developers -> Administrator Access) -> IAM Job Functions
    - Send email login instructions
    - Policies -> Look at the policy for Administrator Access
    - Manage Password Policy (for all accounts)
    - User -> Summary -> Security credentials to change settings for a user
    - Create Role (S3_Admin_Access) -> Has rights to S3

      
    *Takeaways*
    
    - IAM is universal (not tied to a region)
    - Root Account is the original account that set up AWS. It has COMPLETE admin access.
    - New Users have _NO Permissions_ when first created.
    - New Users are assigned Access Key ID & Secret Access Keys when first created. Programitic vs Console Access vs Both.
    - You can only use Access Key ID & Secret Access Keys for programatic access.
    - You can only view Access Key ID & Secret Access Keys once, so save CSV
    - ALWAYS setup MFA
    - Create your own password policies

 
** TODO Section 4: EC2 (2019 course)
   
** TODO Section 5: Databases On AWS (2019 course)
   
** TODO Section 6: Route53 (2019 course)
   
** TODO Section 7: VPCs (2019 course)
   
** TODO Section 8: HA (Highly Available) Architecture (2019 course)
   
** TODO Section 9: Applications (2019 course)
   
** TODO Section 10: Serverless (2019 course)
   
** TODO Section 11: Good Luck & What's Next (2019 course)
 
* TODO Purchase and take AWS Practice Exam
  
* TODO Retake Udemy Mock Exams

* Time
  
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2019-06-24 Mon 17:04]
| Headline                                     | Time   |      |
|----------------------------------------------+--------+------|
| *Total time*                                 | *0:20* |      |
|----------------------------------------------+--------+------|
| Retake Udemy Course                          | 0:20   |      |
| \_  Section 3: Identity Access Management... |        | 0:20 |
#+END:
